#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-landing-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_client_config.current: Reading...
module.datalake_curated.data.azurerm_client_config.current: Reading...
module.databricks_automation.data.azurerm_client_config.current: Reading...
module.datalake_workspace.data.azurerm_client_config.current: Reading...
module.databricks_experimentation.data.azurerm_client_config.current: Reading...
module.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
module.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
module.datalake_raw.data.azurerm_client_config.current: Reading...
data.azurerm_virtual_network.virtual_network: Reading...
module.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
module.datalake_enriched.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
module.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
module.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
module.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_data_factory.data_factory will be created
  + resource "azurerm_data_factory" "data_factory" {
      + id                              = (known after apply)
      + location                        = "northeurope"
      + managed_virtual_network_enabled = true
      + name                            = "dmgmt-dev-adf001"
      + public_network_enabled          = false
      + purview_id                      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
      + resource_group_name             = "dmgmt-dev-runtimes-rg"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_private_endpoint.data_factory_private_endpoint_data_factory will be created
  + resource "azurerm_private_endpoint" "data_factory_private_endpoint_data_factory" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-adf001-datafactory-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-adf001-datafactory-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-runtimes-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-adf001-datafactory-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-adf001-datafactory-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dataFactory",
            ]
        }
    }

  # azurerm_private_endpoint.data_factory_private_endpoint_portal will be created
  + resource "azurerm_private_endpoint" "data_factory_private_endpoint_portal" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-adf001-portal-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-adf001-portal-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-runtimes-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-adf001-portal-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-adf001-portal-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # azurerm_resource_group.management_rg will be created
  + resource "azurerm_resource_group" "management_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "dmgmt-dev-mgmt-rg"
    }

  # azurerm_resource_group.runtimes_rg will be created
  + resource "azurerm_resource_group" "runtimes_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "dmgmt-dev-runtimes-rg"
    }

  # azurerm_resource_group.shared_app_aut_rg will be created
  + resource "azurerm_resource_group" "shared_app_aut_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "dmgmt-dev-shared-app-aut-rg"
    }

  # azurerm_resource_group.shared_app_exp_rg will be created
  + resource "azurerm_resource_group" "shared_app_exp_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "dmgmt-dev-shared-app-exp-rg"
    }

  # azurerm_resource_group.storage_rg will be created
  + resource "azurerm_resource_group" "storage_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "dmgmt-dev-storage-rg"
    }

  # azurerm_subnet.databricks_private_subnet_001 will be created
  + resource "azurerm_subnet" "databricks_private_subnet_001" {
      + address_prefixes                               = [
          + "10.0.34.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DatabricksPrivateSubnet001"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"

      + delegation {
          + name = "DatabricksSubnetDelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # azurerm_subnet.databricks_private_subnet_002 will be created
  + resource "azurerm_subnet" "databricks_private_subnet_002" {
      + address_prefixes                               = [
          + "10.0.38.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DatabricksPrivateSubnet002"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"

      + delegation {
          + name = "DatabricksSubnetDelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # azurerm_subnet.databricks_public_subnet_001 will be created
  + resource "azurerm_subnet" "databricks_public_subnet_001" {
      + address_prefixes                               = [
          + "10.0.36.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DatabricksPublicSubnet001"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"

      + delegation {
          + name = "DatabricksSubnetDelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # azurerm_subnet.databricks_public_subnet_002 will be created
  + resource "azurerm_subnet" "databricks_public_subnet_002" {
      + address_prefixes                               = [
          + "10.0.40.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DatabricksPublicSubnet002"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"

      + delegation {
          + name = "DatabricksSubnetDelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # azurerm_subnet.devops_subnet will be created
  + resource "azurerm_subnet" "devops_subnet" {
      + address_prefixes                               = [
          + "10.0.32.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DevOpsSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"
    }

  # azurerm_subnet.powerbi_subnet will be created
  + resource "azurerm_subnet" "powerbi_subnet" {
      + address_prefixes                               = [
          + "10.0.32.48/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "PowerBiSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"

      + delegation {
          + name = "PowerBIGatewaySubnetDelegation"

          + service_delegation {
              + name = "Microsoft.PowerPlatform/vnetaccesslinks"
            }
        }
    }

  # azurerm_subnet.runtimes_subnet will be created
  + resource "azurerm_subnet" "runtimes_subnet" {
      + address_prefixes                               = [
          + "10.0.32.32/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "RuntimesSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"
    }

  # azurerm_subnet.shared_services_subnet will be created
  + resource "azurerm_subnet" "shared_services_subnet" {
      + address_prefixes                               = [
          + "10.0.32.64/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "SharedServicesSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"
    }

  # azurerm_subnet.storage_subnet will be created
  + resource "azurerm_subnet" "storage_subnet" {
      + address_prefixes                               = [
          + "10.0.32.16/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "StorageSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "mycrp-prd-dlz01-network-rg"
      + virtual_network_name                           = "mycrp-prd-dlz01-vnet001"
    }

  # azurerm_subnet_network_security_group_association.databricks_private_subnet_001_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "databricks_private_subnet_001_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.databricks_private_subnet_002_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "databricks_private_subnet_002_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.databricks_public_subnet_001_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "databricks_public_subnet_001_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.databricks_public_subnet_002_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "databricks_public_subnet_002_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.devops_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "devops_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.powerbi_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "powerbi_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.runtimes_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "runtimes_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.shared_services_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "shared_services_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.storage_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "storage_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_route_table_association.databricks_private_subnet_001_routetable will be created
  + resource "azurerm_subnet_route_table_association" "databricks_private_subnet_001_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.databricks_private_subnet_002_routetable will be created
  + resource "azurerm_subnet_route_table_association" "databricks_private_subnet_002_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.databricks_public_subnet_001_routetable will be created
  + resource "azurerm_subnet_route_table_association" "databricks_public_subnet_001_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.databricks_public_subnet_002_routetable will be created
  + resource "azurerm_subnet_route_table_association" "databricks_public_subnet_002_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.devops_subnet_routetable will be created
  + resource "azurerm_subnet_route_table_association" "devops_subnet_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.powerbi_subnet_routetable will be created
  + resource "azurerm_subnet_route_table_association" "powerbi_subnet_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.runtimes_subnet_routetable will be created
  + resource "azurerm_subnet_route_table_association" "runtimes_subnet_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.shared_services_subnet_routetable will be created
  + resource "azurerm_subnet_route_table_association" "shared_services_subnet_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.storage_subnet_routetable will be created
  + resource "azurerm_subnet_route_table_association" "storage_subnet_routetable" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
      + subnet_id      = (known after apply)
    }

  # module.databricks_automation.azurerm_databricks_workspace.databricks will be created
  + resource "azurerm_databricks_workspace" "databricks" {
      + customer_managed_key_enabled          = false
      + disk_encryption_set_id                = (known after apply)
      + id                                    = (known after apply)
      + infrastructure_encryption_enabled     = true
      + location                              = "northeurope"
      + managed_disk_identity                 = (known after apply)
      + managed_resource_group_id             = (known after apply)
      + managed_resource_group_name           = "dmgmt-dev-aut-dbw001-rg"
      + name                                  = "dmgmt-dev-aut-dbw001"
      + network_security_group_rules_required = "NoAzureDatabricksRules"
      + public_network_access_enabled         = false
      + resource_group_name                   = "dmgmt-dev-shared-app-aut-rg"
      + sku                                   = "premium"
      + storage_account_identity              = (known after apply)
      + workspace_id                          = (known after apply)
      + workspace_url                         = (known after apply)

      + custom_parameters {
          + nat_gateway_name                                     = (known after apply)
          + no_public_ip                                         = true
          + private_subnet_name                                  = "DatabricksPrivateSubnet001"
          + private_subnet_network_security_group_association_id = (known after apply)
          + public_ip_name                                       = (known after apply)
          + public_subnet_name                                   = "DatabricksPublicSubnet001"
          + public_subnet_network_security_group_association_id  = (known after apply)
          + storage_account_name                                 = "dmgmtdevautdbw001"
          + storage_account_sku_name                             = "Standard_ZRS"
          + virtual_network_id                                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001"
          + vnet_address_prefix                                  = (known after apply)
        }
    }

  # module.databricks_automation.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                   = []
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "dmgmt-dev-aut-kv001"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "dmgmt-dev-shared-app-aut-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-aut-dbw001-blob-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-aut-dbw001-blob-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-aut-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-aut-dbw001-blob-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-aut-dbw001-blob-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_dfs" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-aut-dbw001-dfs-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-aut-dbw001-dfs-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-aut-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-aut-dbw001-dfs-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-aut-dbw001-dfs-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_ui" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-aut-dbw001-uiapi-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-aut-dbw001-uiapi-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-aut-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-aut-dbw001-uiapi-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-aut-dbw001-uiapi-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "databricks_ui_api",
            ]
        }
    }

  # module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_web will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-aut-dbw001-web-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-aut-dbw001-web-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-aut-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-aut-dbw001-web-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-aut-dbw001-web-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "browser_authentication",
            ]
        }
    }

  # module.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint will be created
  + resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-aut-kv001-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-aut-kv001-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-aut-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-aut-kv001-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-aut-kv001-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault will be created
  + resource "azurerm_role_assignment" "client_roleassignment_key_vault" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4b9deed4-7d41-48e6-a429-bef3232b7477"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault will be created
  + resource "azurerm_role_assignment" "databricks_roleassignment_key_vault" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2ff814a6-3304-4ab8-85cb-cd0e6f879c1d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.databricks_experimentation.azurerm_databricks_workspace.databricks will be created
  + resource "azurerm_databricks_workspace" "databricks" {
      + customer_managed_key_enabled          = false
      + disk_encryption_set_id                = (known after apply)
      + id                                    = (known after apply)
      + infrastructure_encryption_enabled     = true
      + location                              = "northeurope"
      + managed_disk_identity                 = (known after apply)
      + managed_resource_group_id             = (known after apply)
      + managed_resource_group_name           = "dmgmt-dev-exp-dbw001-rg"
      + name                                  = "dmgmt-dev-exp-dbw001"
      + network_security_group_rules_required = "NoAzureDatabricksRules"
      + public_network_access_enabled         = false
      + resource_group_name                   = "dmgmt-dev-shared-app-exp-rg"
      + sku                                   = "premium"
      + storage_account_identity              = (known after apply)
      + workspace_id                          = (known after apply)
      + workspace_url                         = (known after apply)

      + custom_parameters {
          + nat_gateway_name                                     = (known after apply)
          + no_public_ip                                         = true
          + private_subnet_name                                  = "DatabricksPrivateSubnet002"
          + private_subnet_network_security_group_association_id = (known after apply)
          + public_ip_name                                       = (known after apply)
          + public_subnet_name                                   = "DatabricksPublicSubnet002"
          + public_subnet_network_security_group_association_id  = (known after apply)
          + storage_account_name                                 = "dmgmtdevexpdbw001"
          + storage_account_sku_name                             = "Standard_ZRS"
          + virtual_network_id                                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001"
          + vnet_address_prefix                                  = (known after apply)
        }
    }

  # module.databricks_experimentation.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                   = []
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "dmgmt-dev-exp-kv001"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "dmgmt-dev-shared-app-exp-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-exp-dbw001-blob-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-exp-dbw001-blob-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-exp-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-exp-dbw001-blob-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-exp-dbw001-blob-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_dfs" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-exp-dbw001-dfs-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-exp-dbw001-dfs-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-exp-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-exp-dbw001-dfs-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-exp-dbw001-dfs-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_ui" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-exp-dbw001-uiapi-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-exp-dbw001-uiapi-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-exp-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-exp-dbw001-uiapi-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-exp-dbw001-uiapi-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "databricks_ui_api",
            ]
        }
    }

  # module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_web will be created
  + resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-exp-dbw001-web-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-exp-dbw001-web-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-exp-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-exp-dbw001-web-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-exp-dbw001-web-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "browser_authentication",
            ]
        }
    }

  # module.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint will be created
  + resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-exp-kv001-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-exp-kv001-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-shared-app-exp-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmt-dev-exp-kv001-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-exp-kv001-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault will be created
  + resource "azurerm_role_assignment" "client_roleassignment_key_vault" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4b9deed4-7d41-48e6-a429-bef3232b7477"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault will be created
  + resource "azurerm_role_assignment" "databricks_roleassignment_key_vault" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2ff814a6-3304-4ab8-85cb-cd0e6f879c1d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.datalake_curated.azapi_resource.datalake_containers["data"] will be created
  + resource "azapi_resource" "datalake_containers" {
      + body                      = jsonencode(
            {
              + properties = {
                  + metadata     = {}
                  + publicAccess = "None"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "data"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2021-02-01"
    }

  # module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstcur-blob-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstcur-blob-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstcur-blob-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstcur-blob-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstcur-dfs-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstcur-dfs-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstcur-dfs-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstcur-dfs-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_queue will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_queue" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstcur-queue-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstcur-queue-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstcur-queue-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstcur-queue-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_table will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_table" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstcur-table-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstcur-table-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstcur-table-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstcur-table-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.datalake_curated.azurerm_storage_account.datalake will be created
  + resource "azurerm_storage_account" "datalake" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + allowed_copy_scope                = "AAD"
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = true
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = true
      + large_file_share_enabled          = false
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "dmgmtdevstcur"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Account"
      + resource_group_name               = "dmgmt-dev-storage-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = false
      + table_encryption_key_type         = "Account"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + cors_rule {
              + allowed_headers    = [
                  + "x-ms-blob-type",
                ]
              + allowed_methods    = [
                  + "PUT",
                ]
              + allowed_origins    = [
                  + "https://*.azuredatabricks.net",
                ]
              + exposed_headers    = [
                  + "",
                ]
              + max_age_in_seconds = 1800
            }

          + delete_retention_policy {
              + days = 7
            }
        }

      + network_rules {
          + bypass                     = [
              + "None",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Databricks/accessConnectors/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
        }

      + routing {
          + choice                      = "MicrosoftRouting"
          + publish_internet_endpoints  = false
          + publish_microsoft_endpoints = false
        }
    }

  # module.datalake_curated.azurerm_storage_management_policy.datalake_management_policy will be created
  + resource "azurerm_storage_management_policy" "datalake_management_policy" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 360
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation_greater_than                  = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation                               = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.datalake_enriched.azapi_resource.datalake_containers["data"] will be created
  + resource "azapi_resource" "datalake_containers" {
      + body                      = jsonencode(
            {
              + properties = {
                  + metadata     = {}
                  + publicAccess = "None"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "data"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2021-02-01"
    }

  # module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstenr-blob-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstenr-blob-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstenr-blob-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstenr-blob-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstenr-dfs-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstenr-dfs-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstenr-dfs-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstenr-dfs-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_queue will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_queue" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstenr-queue-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstenr-queue-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstenr-queue-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstenr-queue-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_table will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_table" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstenr-table-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstenr-table-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstenr-table-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstenr-table-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.datalake_enriched.azurerm_storage_account.datalake will be created
  + resource "azurerm_storage_account" "datalake" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + allowed_copy_scope                = "AAD"
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = true
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = true
      + large_file_share_enabled          = false
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "dmgmtdevstenr"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Account"
      + resource_group_name               = "dmgmt-dev-storage-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = false
      + table_encryption_key_type         = "Account"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + cors_rule {
              + allowed_headers    = [
                  + "x-ms-blob-type",
                ]
              + allowed_methods    = [
                  + "PUT",
                ]
              + allowed_origins    = [
                  + "https://*.azuredatabricks.net",
                ]
              + exposed_headers    = [
                  + "",
                ]
              + max_age_in_seconds = 1800
            }

          + delete_retention_policy {
              + days = 7
            }
        }

      + network_rules {
          + bypass                     = [
              + "None",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Databricks/accessConnectors/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
        }

      + routing {
          + choice                      = "MicrosoftRouting"
          + publish_internet_endpoints  = false
          + publish_microsoft_endpoints = false
        }
    }

  # module.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy will be created
  + resource "azurerm_storage_management_policy" "datalake_management_policy" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 360
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation_greater_than                  = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation                               = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.datalake_raw.azapi_resource.datalake_containers["data"] will be created
  + resource "azapi_resource" "datalake_containers" {
      + body                      = jsonencode(
            {
              + properties = {
                  + metadata     = {}
                  + publicAccess = "None"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "data"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2021-02-01"
    }

  # module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstraw-blob-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstraw-blob-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstraw-blob-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstraw-blob-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstraw-dfs-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstraw-dfs-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstraw-dfs-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstraw-dfs-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_queue will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_queue" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstraw-queue-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstraw-queue-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstraw-queue-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstraw-queue-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_table will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_table" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstraw-table-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstraw-table-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstraw-table-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstraw-table-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.datalake_raw.azurerm_storage_account.datalake will be created
  + resource "azurerm_storage_account" "datalake" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + allowed_copy_scope                = "AAD"
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = true
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = true
      + large_file_share_enabled          = false
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "dmgmtdevstraw"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Account"
      + resource_group_name               = "dmgmt-dev-storage-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = false
      + table_encryption_key_type         = "Account"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + cors_rule {
              + allowed_headers    = [
                  + "x-ms-blob-type",
                ]
              + allowed_methods    = [
                  + "PUT",
                ]
              + allowed_origins    = [
                  + "https://*.azuredatabricks.net",
                ]
              + exposed_headers    = [
                  + "",
                ]
              + max_age_in_seconds = 1800
            }

          + delete_retention_policy {
              + days = 7
            }
        }

      + network_rules {
          + bypass                     = [
              + "None",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Databricks/accessConnectors/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
        }

      + routing {
          + choice                      = "MicrosoftRouting"
          + publish_internet_endpoints  = false
          + publish_microsoft_endpoints = false
        }
    }

  # module.datalake_raw.azurerm_storage_management_policy.datalake_management_policy will be created
  + resource "azurerm_storage_management_policy" "datalake_management_policy" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 360
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation_greater_than                  = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation                               = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.datalake_workspace.azapi_resource.datalake_containers["data"] will be created
  + resource "azapi_resource" "datalake_containers" {
      + body                      = jsonencode(
            {
              + properties = {
                  + metadata     = {}
                  + publicAccess = "None"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "data"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2021-02-01"
    }

  # module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstwsp-blob-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstwsp-blob-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstwsp-blob-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstwsp-blob-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstwsp-dfs-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstwsp-dfs-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstwsp-dfs-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstwsp-dfs-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_queue" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstwsp-queue-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstwsp-queue-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstwsp-queue-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstwsp-queue-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table will be created
  + resource "azurerm_private_endpoint" "datalake_private_endpoint_table" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmtdevstwsp-table-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmtdevstwsp-table-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-storage-rg"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dmgmtdevstwsp-table-arecord"
          + private_dns_zone_ids = [
              + "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmtdevstwsp-table-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.datalake_workspace.azurerm_storage_account.datalake will be created
  + resource "azurerm_storage_account" "datalake" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + allowed_copy_scope                = "AAD"
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = true
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = true
      + large_file_share_enabled          = false
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "dmgmtdevstwsp"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Account"
      + resource_group_name               = "dmgmt-dev-storage-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = false
      + table_encryption_key_type         = "Account"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + cors_rule {
              + allowed_headers    = [
                  + "x-ms-blob-type",
                ]
              + allowed_methods    = [
                  + "PUT",
                ]
              + allowed_origins    = [
                  + "https://*.azuredatabricks.net",
                ]
              + exposed_headers    = [
                  + "",
                ]
              + max_age_in_seconds = 1800
            }

          + delete_retention_policy {
              + days = 7
            }
        }

      + network_rules {
          + bypass                     = [
              + "None",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Databricks/accessConnectors/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
          + private_link_access {
              + endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*"
              + endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            }
        }

      + routing {
          + choice                      = "MicrosoftRouting"
          + publish_internet_endpoints  = false
          + publish_microsoft_endpoints = false
        }
    }

  # module.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy will be created
  + resource "azurerm_storage_management_policy" "datalake_management_policy" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 360
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation_greater_than                  = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 180
                  + delete_after_days_since_creation                               = 360
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.shir_001.data.azurerm_data_factory.data_factory will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_data_factory" "data_factory" {
      + github_configuration = (known after apply)
      + id                   = (known after apply)
      + identity             = (known after apply)
      + location             = (known after apply)
      + name                 = (known after apply)
      + resource_group_name  = (known after apply)
      + tags                 = (known after apply)
      + vsts_configuration   = (known after apply)
    }

  # module.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_shir" {
      + data_factory_id             = (known after apply)
      + id                          = (known after apply)
      + name                        = "dmgmt-dev-shir001"
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.shir_001.azurerm_lb.lb will be created
  + resource "azurerm_lb" "lb" {
      + id                   = (known after apply)
      + location             = "northeurope"
      + name                 = "dmgmt-dev-shir001-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "dmgmt-dev-storage-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "frontendipconfiguration"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
          + zones                                              = [
              + "1",
              + "2",
              + "3",
            ]
        }
    }

  # module.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool will be created
  + resource "azurerm_lb_backend_address_pool" "lb_backend_address_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "dmgmt-dev-shir001-backendaddresspool"
      + outbound_rules            = (known after apply)
    }

  # module.shir_001.azurerm_lb_backend_address_pool_address.lb_backend_address_pool_address will be created
  + resource "azurerm_lb_backend_address_pool_address" "lb_backend_address_pool_address" {
      + backend_address_ip_configuration_id = (known after apply)
      + backend_address_pool_id             = (known after apply)
      + id                                  = (known after apply)
      + inbound_nat_rule_port_mapping       = (known after apply)
      + name                                = "dmgmt-dev-shir001-backendaddresspool-address"
    }

  # module.shir_001.azurerm_lb_nat_pool.lb_nat_pool will be created
  + resource "azurerm_lb_nat_pool" "lb_nat_pool" {
      + backend_port                   = 3389
      + floating_ip_enabled            = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "frontendipconfiguration"
      + frontend_port_end              = 50099
      + frontend_port_start            = 50000
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + loadbalancer_id                = (known after apply)
      + name                           = "dmgmt-dev-shir001-natpool"
      + protocol                       = "Tcp"
      + resource_group_name            = "dmgmt-dev-storage-rg"
      + tcp_reset_enabled              = true
    }

  # module.shir_001.azurerm_lb_probe.lb_probe will be created
  + resource "azurerm_lb_probe" "lb_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "dmgmt-dev-shir001-probe"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Http"
      + request_path        = "/"
    }

  # module.shir_001.azurerm_lb_rule.lb_rule will be created
  + resource "azurerm_lb_rule" "lb_rule" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + enable_tcp_reset               = true
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "frontendipconfiguration"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "dmgmt-dev-shir001-rule"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.shir_001.azurerm_windows_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "vmss" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = (sensitive value)
      + computer_name_prefix                              = "dmgmt-dev"
      + custom_data                                       = (sensitive value)
      + do_not_run_extensions_on_overprovisioned_machines = true
      + enable_automatic_updates                          = true
      + encryption_at_host_enabled                        = true
      + extension_operations_enabled                      = true
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "northeurope"
      + max_bid_price                                     = -1
      + name                                              = "dmgmt-dev-shir001"
      + overprovision                                     = false
      + platform_fault_domain_count                       = 1
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "dmgmt-dev-storage-rg"
      + scale_in_policy                                   = (known after apply)
      + secure_boot_enabled                               = true
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ads_v5"
      + timezone                                          = "UTC"
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Automatic"
      + vtpm_enabled                                      = true
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
          + "2",
          + "3",
        ]

      + automatic_os_upgrade_policy {
          + disable_automatic_rollback  = false
          + enable_automatic_os_upgrade = true
        }

      + extension {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "dmgmt-dev-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "dmgmt-dev-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "Premium_ZRS"
          + write_accelerator_enabled = false

          + diff_disk_settings {
              + option    = "Local"
              + placement = "CacheDisk"
            }
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

  # module.shir_001.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 90 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>